INSERT INTO  public."Surveys" ("Name", "Description", "CreateTime", "UpdateTime", "IsActive")
VALUES 
('Отзывы клиентов', 'Опрос для сбора мнений клиентов', '2023-10-01 10:00:00', '2023-10-05 15:00:00', true),
('Удовлетворенность сотрудников', 'Внутренний опрос для сотрудников', '2023-10-02 09:00:00', NULL, true);

INSERT INTO public."Questions" ("Name", "TypeAnswer", "SerialNumber", "SurveyId")
VALUES 
('Насколько вы удовлетворены?', 1, 1, 1),
('Что мы можем улучшить?', 2, 2, 1),
('Как вы оцениваете своего руководителя?', 1, 1, 2),
('Какие льготы вы цените?', 2, 2, 2);

INSERT INTO public."Answers" ("Name", "SerialNumber", "QuestionId")
VALUES 
('Очень доволен', 1, 1),
('Доволен', 2, 1),
('Нейтрально', 3, 1),
('Не доволен', 4, 1),
('Очень не доволен', 5, 1),
('Лучшее обслуживание клиентов', 1, 2),
('Более быстрая доставка', 2, 2),
('Отлично', 1, 3),
('Хорошо', 2, 3),
('Средне', 3, 3),
('Плохо', 4, 3),
('Медицинская страховка', 1, 4),
('Гибкий график', 2, 4),
('Удаленная работа', 3, 4);

INSERT INTO public."Interviews" ("UserId", "StartTime", "FinishTime", "Status", "SurveyId")
VALUES 
(101, '2023-10-10 14:00:00', '2023-10-10 14:30:00', 1, 1),
(102, '2023-10-11 10:00:00', '2023-10-11 10:45:00', 1, 2);

INSERT INTO public."Results" ("InterviewId", "QuestionId", "AnswerId", "AnswerTime")
VALUES 
(1, 1, 2, '2023-10-10 14:05:00'),
(1, 2, 6, '2023-10-10 14:10:00'),
(2, 3, 8, '2023-10-11 10:10:00'),
(2, 4, 12, '2023-10-11 10:20:00');
